

export default {
    themeSelect: "white",
    // 主题
    themes: {
        white: [
            // 背景颜色
            ["--bgColor", "rgb(255, 165, 92)"],
            // 第一屏背景颜色
            ["--firstBgColor", "linear-gradient(to top, rgb(255, 165, 92), rgb(255, 159, 49))"],
            // 山颜色
            ["--hillColor1", "rgb(115, 49, 54)"],
            ["--hillColor2", "rgb(131, 55, 59)"],
            ["--hillColor3", "rgb(162, 72, 80)"],
            ["--hillColor4", "rgb(221, 102, 107)"],
            // 大地颜色
            ["--earth", "linear-gradient(to top right, rgb(202, 112, 117), rgb(126, 50, 53))"],
            // 小草颜色
            ["--cao", "linear-gradient(to top, rgb(202, 112, 117), rgb(126, 50, 53))"],
            // 标题文字颜色
            ["--titleColor", "rgb(255, 69, 32)"],
            // 标题文字阴影
            ["--titleShadow", "2px 2px 0px rgba(255, 255, 255, .8), 0 0 10px rgba(0, 0, 0, .5)"],
            // 图标菜单阴影
            ["--iconShadow", "0 0 5px white"],
        ],
        dark: [
            // 背景颜色
            ["--bgColor", "rgb(48, 37, 95)"],
            // 第一屏背景颜色
            ["--firstBgColor", "linear-gradient(to top, rgb(78, 36, 88), rgb(13, 18, 51))"],
            // 山颜色
            ["--hillColor1", "rgb(36, 32, 74)"],
            ["--hillColor2", "rgb(41, 35, 94)"],
            ["--hillColor3", "rgb(65, 37, 71)"],
            ["--hillColor4", "rgb(87, 50, 95)"],
            // 大地颜色
            ["--earth", "linear-gradient(to top right, rgb(43, 38, 95), rgb(61, 36, 95))"],
            // 小草颜色
            ["--cao", "linear-gradient(to top, rgb(85, 49, 96), rgb(78, 72, 128))"],
            // 标题文字颜色
            ["--titleColor", "rgb(136, 65, 167)"],
            // 标题文字阴影
            ["--titleShadow", "2px 2px 0px rgba(255, 255, 255, .8), 0 0 10px rgba(0, 0, 0, .5)"],
            // 图标菜单阴影
            ["--iconShadow", "0 0 2px white"],
        ]
    },
    lovexhj1: {
        title: "对笨蛋美女说的小情话",
        subTitle: "亲亲，抱抱，举高高",
    },
    lovexhj2: {
        content: `
        <h1>2023年亲爱的笨蛋美女年度总结</h1>
        <h2>我是你的永远守候</h2>
        <br></br>
        <p>又一个年头过去了，回想起这一年里的点点滴滴，我心里充满了感慨。🍂每个瞬间都如同珍贵的珍珠，串联起我们共同的回忆。</p>
        <br></br>
        <p>今年，有件事我始终放在心上，那就是我对你发了脾气。那一刻的我，让情绪盖过了理智，让你受到了委屈。回想起来，我真的很后悔，是我不对，宝贝，对不起。🙏</p>
        <br></br>
        <p>时间如同白驹过隙，转眼间，我们即将迎来人生的一个新阶段——<b>毕业</b>。这个重要的时刻，让我更加深刻地意识到，我多么希望能和你一起面对未来的每一个挑战，每一个机遇。</p>
        <br></br>
        <p>这一年里，我学会了更多关于如何珍惜和感激。每次看到你为我做的小事，无论是一个甜甜的亲亲，还是一个鼓励的拥抱，都让我深深感受到爱的力量。💖</p>
        <br></br>
        <p>我们的故事里充满了欢笑，也有泪水，但所有的这一切，都是我们共同成长的见证。我开始学会如何更好地控制自己的情绪，如何在关键时刻给予你支持和理解。</p>
        <br></br>
        <p>看着你的笑容，我知道，无论未来的路有多难走，只要我们手牵手，就没有什么是我们克服不了的。👫</p>
        <br></br>
        <p>今年，我更加明白了，真正的爱，不仅仅是激情的追求，更是在平凡的日子里，对彼此的深深依赖和不离不弃。</p>
        <br></br>
        <p>宝贝，感谢你给我的每一天，都如此特别。我期待着我们的未来，更多的早安晚安，更多的共同经历，以及那些还没来得及实现的梦想。</p>
        <br></br>
        <p>在这个特别的年份结束时，我想对你说：遇见你，是我最大的幸运。你是我的太阳，无论何时都能给我带来光明和温暖。🌞</p>
        <br></br>
        <p>2023年，我们一起走过，感谢有你。愿未来的日子里，我们能够肩并肩，继续书写属于我们两个人的美好故事。</p>
        <br></br>

        
        <h1>2022年亲爱的笨蛋美女年度总结</h1>
        <h2>我是你的不正经</h2>
        <br></br>
        <p>遇见你在我心里埋下一颗小小的种子🌱，偷偷幻想过💭无数次和你的未来生活。</p>
        <br></br>
        <p>后来和你谈恋爱，让我看到了我的内心的自己😨，对你有点变态的控制欲和占有欲，但是总是怕你会讨厌这样的我</p>
        <br></br>
        <p>你总是问我是什么时候喜欢你的，有很多答案但还是觉得不能表达出，开始我总是认为是你的甜美的笑，
        你叫我的坏家伙的样子，你的古灵精怪，也不是我身边恋爱朋友💑的影响， 而是我在下雨时会想某个笨蛋
        美女会不会没有带伞🌂，在你没有回消息时想你在干嘛，变得患得患失</p>
        <br></br>
        <p>每次握起你冰冰凉的小手，都想要把你抱进怀里🤗，第一次看你掉小珍珠，
        我明白了世界上最好看最善良最体贴的那个女孩👧让我遇到了</p>
        <br></br>
        <p>每次吵架惹你生气看你眼睛红红的掉眼泪，我真想打自己几巴掌，不哭了宝贝~</p>
        <br></br>
        <p>吵完架总是你向我妥协，越发觉得我自己错的让人不可饶恕，越发看到你身上的温柔和体贴。
        （⚠️警示自己：遇到了我最喜欢的人，我可不要轻易分开）</p>
        <br></br>
        <p>宝贝要记住，当我没有主动的时候，我可能在准备给你的惊喜🎁，不要离开我好不好</p>
        <br></br>
        <p>我对爱情的感觉是，就是从心底里<b>喜欢你</b>，觉得你的一举一动都很亲切，不开心你比喜欢我更喜欢别人🙁。
        和你在一起让我我懂得了什么是边界感，原来你的一颦一笑，你的无心说的每句话，接触的每一个异性，都会在我的心里留下印迹👣</p>
        <br></br>
        <p> 很开心在这个可以自已做决定的年龄<b>遇见你</b></p>
        <br></br>
        <p> 我们还有很多个早安晚安，很多个一起散步的夜晚，很多个怎么腻歪都不嫌多的亲亲宝宝，还有未来我还想实现的更多的<a>羞羞的坏事</a></p>
        <br></br>   
        <p>对我来说今年最幸运的事🍀，就是遇见你，你像一束白月光透进我的生活，让我知道原来只是吃饭，散步都可以变得这么令人吸引，
        每次我都在伤心的事是我们的相遇可能没有结果，但遇见你已经是我的上上签🔖。</p>
        <br></br>  
        <p> 这一年的故事很简单🕓，遇见了你我很喜欢💘！</p>
        <br></br>   
        `,
        img: "https://lovexhj.oss-cn-beijing.aliyuncs.com/me/images/me.jpg"
    }

}
